app/views/api/v1/locations/show.json.jbuilder

SELECT "recordings".* FROM "recordings" WHERE "recordings"."location_id" = ? ORDER BY "recordings"."id" DESC LIMIT ?  [["location_id", 1], ["LIMIT", 1]]
---
json.current do
  json.temp @location.recordings.first.temp
  json.status @location.recordings.first.status